



MASQUE                                                 A. Chernyakhovsky
Internet-Draft                                                 D. McCall
Intended status: Standards Track                             D. Schinazi
Expires: 14 October 2021                                      Google LLC
                                                           12 April 2021


                       The CONNECT-IP HTTP Method
                     draft-cms-masque-connect-ip-00

Abstract

   This document describes the CONNECT-IP HTTP method.  CONNECT-IP is
   similar to CONNECT-UDP, but allows transmitting IP packets, without
   being limited to just TCP like CONNECT or UDP like CONNECT-UDP.

Discussion Venues

   This note is to be removed before publishing as an RFC.

   Discussion of this document takes place on the Multiplexed
   Application Substrate over QUIC Encryption Working Group mailing list
   (masque@ietf.org), which is archived at
   https://mailarchive.ietf.org/arch/browse/masque/.

   Source for this draft and an issue tracker can be found at
   https://github.com/DavidSchinazi/draft-cms-masque-connect-ip.

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at https://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on 14 October 2021.







Chernyakhovsky, et al.   Expires 14 October 2021                [Page 1]

Internet-Draft                 CONNECT-IP                     April 2021


Copyright Notice

   Copyright (c) 2021 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents (https://trustee.ietf.org/
   license-info) in effect on the date of publication of this document.
   Please review these documents carefully, as they describe your rights
   and restrictions with respect to this document.  Code Components
   extracted from this document must include Simplified BSD License text
   as described in Section 4.e of the Trust Legal Provisions and are
   provided without warranty as described in the Simplified BSD License.

Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3
     1.1.  Conventions and Definitions . . . . . . . . . . . . . . .   3
   2.  The CONNECT-IP Method . . . . . . . . . . . . . . . . . . . .   3
   3.  Transmitting IP Packets using HTTP Datagrams  . . . . . . . .   4
   4.  Routes  . . . . . . . . . . . . . . . . . . . . . . . . . . .   4
   5.  Stream Chunks . . . . . . . . . . . . . . . . . . . . . . . .   5
   6.  Messages  . . . . . . . . . . . . . . . . . . . . . . . . . .   5
     6.1.  IP_PACKET Message . . . . . . . . . . . . . . . . . . . .   5
     6.2.  ADDRESS_ASSIGN Message  . . . . . . . . . . . . . . . . .   6
     6.3.  ADDRESS_REQUEST Message . . . . . . . . . . . . . . . . .   6
     6.4.  ROUTE_ADVERTISEMENT Message . . . . . . . . . . . . . . .   7
     6.5.  ROUTE_REJECTION Message . . . . . . . . . . . . . . . . .   8
     6.6.  ROUTE_RESET Message . . . . . . . . . . . . . . . . . . .   8
     6.7.  SHUTDOWN Message  . . . . . . . . . . . . . . . . . . . .   9
     6.8.  ATOMIC_START Message  . . . . . . . . . . . . . . . . . .   9
     6.9.  ATOMIC_END Message  . . . . . . . . . . . . . . . . . . .  10
   7.  Extensibility Considerations  . . . . . . . . . . . . . . . .  10
   8.  Security Considerations . . . . . . . . . . . . . . . . . . .  10
   9.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .  11
     9.1.  HTTP Method . . . . . . . . . . . . . . . . . . . . . . .  11
     9.2.  Stream Chunk Type Registration  . . . . . . . . . . . . .  11
   10. References  . . . . . . . . . . . . . . . . . . . . . . . . .  11
     10.1.  Normative References . . . . . . . . . . . . . . . . . .  12
     10.2.  Informative References . . . . . . . . . . . . . . . . .  12
   Appendix A.  Examples . . . . . . . . . . . . . . . . . . . . . .  13
     A.1.  Consumer VPN  . . . . . . . . . . . . . . . . . . . . . .  13
   Acknowledgments . . . . . . . . . . . . . . . . . . . . . . . . .  13
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  13







Chernyakhovsky, et al.   Expires 14 October 2021                [Page 2]

Internet-Draft                 CONNECT-IP                     April 2021


1.  Introduction

   This document describes the CONNECT-IP HTTP method.  CONNECT-IP is
   similar to CONNECT-UDP, but allows transmitting IP packets, without
   being limited to just TCP like CONNECT or UDP like CONNECT-UDP.

   CONNECT-IP allows endpoints to set up an IP tunnel between one
   another.  This can be used to implement a consumer VPN, point-to-
   point, point-to-network, and network-to-network capabilities as
   described in [REQS].

1.1.  Conventions and Definitions

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "NOT RECOMMENDED", "MAY", and
   "OPTIONAL" in this document are to be interpreted as described in BCP
   14 [RFC2119] [RFC8174] when, and only when, they appear in all
   capitals, as shown here.

   In this document, we use the term "proxy" to refer to the HTTP server
   that responds to the CONNECT-IP request.  If there are HTTP
   intermediaries (as defined in Section 2.3 of [RFC7230]) between the
   client and the proxy, those are referred to as "intermediaries" in
   this document.

2.  The CONNECT-IP Method

   The CONNECT-IP method establishes a stream to an endpoint server that
   then permits the exchange of control data, such as IP address
   information, reachable IP ranges, and other relevant information for
   successfully transmitting IP datagrams between hosts.

   The request-target of a CONNECT-IP request is a URI [URI] which uses
   the "https" scheme and an immutable path of "/".  When using HTTP/2
   [H2] or later, CONNECT-IP requests use HTTP pseudo-headers with the
   following requirements:

   *  The ":method" pseudo-header field is set to "CONNECT-IP".

   *  The ":scheme" pseudo-header field is set to "https".

   *  The ":path" pseudo-header field is set to "/".

   *  The ":authority" pseudo-header field contains the host and port of
      the proxy.  The target of a CONNECT-IP request is the server
      providing the CONNECT-IP featureset, not an individual endpoint
      with which a connection is desired.




Chernyakhovsky, et al.   Expires 14 October 2021                [Page 3]

Internet-Draft                 CONNECT-IP                     April 2021


   A CONNECT-IP request that does not conform to these restrictions is
   malformed (see [H2], Section 8.1.2.6).

   Any 2xx (Successful) response indicates that the proxy is willing to
   open an IP tunnel between it and the client.  Any response other than
   a successful response indicates that the tunnel has not yet been
   formed.

   A proxy MUST NOT send any Transfer-Encoding or Content-Length header
   fields in a 2xx (Successful) response to CONNECT-IP.  A client MUST
   treat a successful response to CONNECT-IP containing any Content-
   Length or Transfer-Encoding header fields as malformed.

   A payload within a CONNECT-IP request message has no defined
   semantics; a CONNECT-IP request with a non-empty payload is
   malformed.  Note that the CONNECT-IP stream is used to convey control
   messages, but they are not semantically part of the request or
   response themselves.

   Responses to the CONNECT-IP method are not cacheable.

   The lifetime of the tunnel is tied to the CONNECT-IP stream.  Closing
   the stream (via the FIN bit on a QUIC STREAM frame, or a QUIC
   RESET_STREAM frame) closes the associated tunnel.

3.  Transmitting IP Packets using HTTP Datagrams

   When the HTTP connection supports HTTP/3 datagrams [H3DGRAM], IP
   packets can be sent using them.  The HTTP/3 Datagram Payload contains
   a full IP packet, from the IP Version field until the last byte of
   the IP Payload.

4.  Routes

   Endpoints have the ability to advertise and reject routes using the
   ROUTE_ADVERTISEMENT (Section 6.4) and ROUTE_REJECTION (Section 6.4)
   messages.  Note that these messages are purely informational: receipt
   of a ROUTE_ADVERTISEMENT message does not require the recipient to
   start routing traffic to its peer.  Additionally, if an endpoint
   receives a ROUTE_REJECTION for a given prefix that it had previously
   received a ROUTE_ADVERTISEMENT message for, then the two cancel out
   and the endpoint MUST remove its state from the ROUTE_ADVERTISEMENT
   message instead of installing new state for the ROUTE_REJECTION
   message.  Conversely, the same is true of a ROUTE_ADVERTISEMENT that
   matches a previous ROUTE_REJECTION.  Routes are handled via longest-
   prefix-first preference, meaning that if a given IP prefix is covered
   by multiple route advertisement and route rejections, the one with
   the longest prefix is used.



Chernyakhovsky, et al.   Expires 14 October 2021                [Page 4]

Internet-Draft                 CONNECT-IP                     April 2021


5.  Stream Chunks

   The DATA stream tied to the bidirectional stream that the CONNECT-IP
   request was sent on is a sequence of CONNECT-IP Stream Chunks, which
   are defined as a sequence of type-length-value tuples using the
   following format (using the notation from the "Notational
   Conventions" section of [QUIC]):

   CONNECT-IP Stream {
     CONNECT-IP Stream Chunk (..) ...,
   }

                     Figure 1: CONNECT-IP Stream Format

   CONNECT-IP Stream Chunk {
     CONNECT-IP Stream Chunk Type (i),
     CONNECT-IP Stream Chunk Length (i),
     CONNECT-IP Stream Chunk Value (..),
   }

                  Figure 2: CONNECT-IP Stream Chunk Format

   CONNECT-IP Stream Chunk Type:  A variable-length integer indicating
      the Type of the CONNECT-IP Stream Chunk.  Endpoints that receive a
      chunk with an unknown CONNECT-IP Stream Chunk Type MUST silently
      skip over that chunk.

   CONNECT-IP Stream Chunk Length:  The length of the CONNECT-IP Stream
      Chunk Value field following this field.  Note that this field can
      have a value of zero.

   CONNECT-IP Stream Chunk Value:  The payload of this chunk.  Its
      semantics are determined by the value of the CONNECT-IP Stream
      Chunk Type field.

6.  Messages

6.1.  IP_PACKET Message

   The IP_PACKET message allows conveying IP Packets when HTTP/3
   Datagrams are not available.  This message uses a CONNECT-IP Stream
   Chunk Type of 0x00.  Its value uses the following format:

   IP_PACKET Message {
     IP Packet (...),
   }

                     Figure 3: IP_PACKET Message Format



Chernyakhovsky, et al.   Expires 14 October 2021                [Page 5]

Internet-Draft                 CONNECT-IP                     April 2021


   IP Packet:  A full IP packet, from the IP Version field until the
      last byte of the IP Payload.

   Note that this message MAY still be used even when HTTP/3 datagrams
   are available.

6.2.  ADDRESS_ASSIGN Message

   The ADDRESS_ASSIGN message allows an endpoint to inform its peer that
   it has assigned an IP address to it.  It allows assigning a prefix
   which can contain multiple addresses.  This message uses a CONNECT-IP
   Stream Chunk Type of 0x01.  Its value uses the following format:

   ADDRESS_ASSIGN Message {
     IP Version (8),
     IP Address (32..128),
     IP Prefix Length (8),
   }

                  Figure 4: ADDRESS_ASSIGN Message Format

   IP Version:  IP Version of this address assignment.  MUST be either 4
      or 6.

   IP Address:  Assigned IP address.  If the IP Version field has value
      4, the IP Address field SHALL have a length of 32 bits.  If the IP
      Version field has value 6, the IP Address field SHALL have a
      length of 128 bits.

   IP Prefix Length:  Length of the IP Prefix assigned, in bits.  MUST
      be lesser or equal to the length of the IP Address field, in bits.

6.3.  ADDRESS_REQUEST Message

   The ADDRESS_REQUEST message allows an endpoint to request assignment
   of an IP address from its peer.  It allows the endpoint to optionally
   indicate a preference for which address it would get assigned.  This
   message uses a CONNECT-IP Stream Chunk Type of 0x02.  Its value uses
   the following format:

   ADDRESS_REQUEST Message {
     IP Version (8),
     IP Address (32..128),
     IP Prefix Length (8),
   }

                  Figure 5: ADDRESS_REQUEST Message Format




Chernyakhovsky, et al.   Expires 14 October 2021                [Page 6]

Internet-Draft                 CONNECT-IP                     April 2021


   IP Version:  IP Version of this address request.  MUST be either 4 or
      6.

   IP Address:  Requested IP address.  If the IP Version field has value
      4, the IP Address field SHALL have a length of 32 bits.  If the IP
      Version field has value 6, the IP Address field SHALL have a
      length of 128 bits.

   IP Prefix Length:  Length of the IP Prefix requested, in bits.  MUST
      be lesser or equal to the length of the IP Address field, in bits.

   Upon receiving the ADDRESS_REQUEST message, an endpoint SHOULD assign
   an IP address to its peer, and then respond with an ADDRESS_ASSIGN
   message to inform the peer of the assignment.

6.4.  ROUTE_ADVERTISEMENT Message

   The ROUTE_ADVERTISEMENT message allows an endpoint to communicate to
   its peer that it is willing to route traffic to a given prefix.  This
   message uses a CONNECT-IP Stream Chunk Type of 0x03.  Its value uses
   the following format:

   ROUTE_ADVERTISEMENT Message {
     IP Version (8),
     IP Address (32..128),
     IP Prefix Length (8),
   }

                Figure 6: ROUTE_ADVERTISEMENT Message Format

   IP Version:  IP Version of this route advertisement.  MUST be either
      4 or 6.

   IP Address:  IP address of the advertised route.  If the IP Version
      field has value 4, the IP Address field SHALL have a length of 32
      bits.  If the IP Version field has value 6, the IP Address field
      SHALL have a length of 128 bits.

   IP Prefix Length:  Length of the IP Prefix of the advertised route,
      in bits.  MUST be lesser or equal to the length of the IP Address
      field, in bits.

   Upon receiving the ROUTE_ADVERTISEMENT message, an endpoint MAY start
   routing IP packets in that prefix to its peer.







Chernyakhovsky, et al.   Expires 14 October 2021                [Page 7]

Internet-Draft                 CONNECT-IP                     April 2021


6.5.  ROUTE_REJECTION Message

   The ROUTE_REJECTION message allows an endpoint to communicate to its
   peer that it is not willing to route traffic to a given prefix.  This
   message uses a CONNECT-IP Stream Chunk Type of 0x04.  Its value uses
   the following format:

   ROUTE_REJECTION Message {
     IP Version (8),
     IP Address (32..128),
     IP Prefix Length (8),
   }

                  Figure 7: ROUTE_REJECTION Message Format

   IP Version:  IP Version of this route rejection.  MUST be either 4 or
      6.

   IP Address:  IP address of the rejected route.  If the IP Version
      field has value 4, the IP Address field SHALL have a length of 32
      bits.  If the IP Version field has value 6, the IP Address field
      SHALL have a length of 128 bits.

   IP Prefix Length:  Length of the IP Prefix of the advertised route,
      in bits.  MUST be lesser or equal to the length of the IP Address
      field, in bits.

   Upon receiving the ROUTE_REJECTION message, an endpoint MUST stop
   routing IP packets in that prefix to its peer.  Note that this
   message can be reordered with DATAGRAM frames, and therefore an
   endpoint that receives packets for routes it has rejected MUST NOT
   treat that as an error.

6.6.  ROUTE_RESET Message

   The ROUTE_RESET message allows an endpoint to cancel any routes it
   had previously advertised or denied.  This message uses a CONNECT-IP
   Stream Chunk Type of 0x05.  Its value uses the following format:

   ROUTE_RESET Message {
   }

                    Figure 8: ROUTE_RESET Message Format

   Upon receiving the ROUTE_RESET message, an endpoint MUST stop routing
   IP packets to its peer.  Note that this message can be reordered with
   DATAGRAM frames, and therefore an endpoint that receives packets for
   routes it has rejected MUST NOT treat that as an error.



Chernyakhovsky, et al.   Expires 14 October 2021                [Page 8]

Internet-Draft                 CONNECT-IP                     April 2021


   The main purpose of the ROUTE_RESET message is to allow endpoints to
   not have to remember the full list of routes they have shared with
   their peer.  In practice, it is expected that ROUTE_RESET messages
   will be closely followed by ROUTE_ADVERTISEMENT messages that will
   refill the routing table that was just cleared.

6.7.  SHUTDOWN Message

   The SHUTDOWN message allows an endpoint to communicate to its peer
   that it is about to close the CONNECT-IP stream, with a string
   explaining the reason for the shutdown.  This message uses a CONNECT-
   IP Stream Chunk Type of 0x06.  Its value uses the following format:

   SHUTDOWN Message {
     Reason Phrase (..),
   }

                     Figure 9: SHUTDOWN Message Format

   Reason Phrase:  Additional diagnostic information for the shutdown.
      This SHOULD be a UTF-8 encoded string [UTF8], though the frame
      does not carry information, such as language tags, that would aid
      comprehension by any entity other than the one that created the
      text.

   Note that the SHUTDOWN message is informational, the tunnel is only
   closed when its corresponding CONNECT-IP stream is closed.  Endpoints
   MAY close the tunnel with a reason phrase by sending the SHUTDOWN
   message with the FIN bit set on the underlying QUIC STREAM frame that
   carried it.

6.8.  ATOMIC_START Message

   The ATOMIC_START message allows an endpoint to create an atomic set
   of messages.  This message uses a CONNECT-IP Stream Chunk Type of
   0x07.  Its value uses the following format:

   ATOMIC_START Message {
   }

                   Figure 10: ATOMIC_START Message Format

   Upon receiving an ATOMIC_START message, an endpoint MUST buffer all
   incoming known messages until it receives an ATOMIC_END message.
   Endpoints MUST NOT send two ATOMIC_START messages without an
   ATOMIC_END message between them.





Chernyakhovsky, et al.   Expires 14 October 2021                [Page 9]

Internet-Draft                 CONNECT-IP                     April 2021


   Endpoints MUST NOT buffer unknown messages.  Endpoints MAY choose to
   immediately process IP_PACKET and SHUTDOWN messages instead of
   buffering them.  Extensions that register new message types MAY
   specify that it is allowed to skip buffering for them.

   The purpose of this frame is to avoid timing issues where an endpoint
   installs a route before an important route rejection was received.
   Endpoints SHOULD group their initial configuration into an atomic
   block to allow their peer to mark the tunnel as operational once the
   whole block is parsed.

6.9.  ATOMIC_END Message

   The ATOMIC_END message allows an endpoint to end an atomic set of
   messages.  This message uses a CONNECT-IP Stream Chunk Type of 0x08.
   Its value uses the following format:

   ATOMIC_END Message {
   }

                    Figure 11: ATOMIC_END Message Format

   Upon receiving an ATOMIC_END message, an endpoint MUST parse all
   previously buffered messages, in order of receipt.  Endpoints MUST
   NOT send an ATOMIC_END message without a preceding ATOMIC_START
   message.

7.  Extensibility Considerations

   CONNECT-IP can be extended via multiple mechanisms to increase
   functionality.  There are two main ways to extend CONNECT-IP: HTTP
   headers and CONNECT-IP Stream Chunk Types.  For example, an
   authentication extension could define an HTTP header that allows
   endpoints to send authentication credentials to their peer during the
   creation of the tunnel.  Alternatively, one could specify an
   extension that defines a new CONNECT-IP Stream Chunk Type which
   allows exchanging DNS configuration between endpoints.

8.  Security Considerations

   There are significant risks in allowing arbitrary clients to
   establish a tunnel to arbitrary servers, as that could allow bad
   actors to send traffic and have it attributed to the proxy.  Proxies
   that support CONNECT-IP SHOULD restrict its use to authenticated
   users.  The HTTP Authorization header [AUTH] MAY be used to
   authenticate clients.  More complex authentication schemes are out of
   scope for this document but can be implemented using CONNECT-IP
   extensions.



Chernyakhovsky, et al.   Expires 14 October 2021               [Page 10]

Internet-Draft                 CONNECT-IP                     April 2021


9.  IANA Considerations

9.1.  HTTP Method

   This document will request IANA to register "CONNECT-IP" in the HTTP
   Method Registry (IETF review) maintained at
   <https://www.iana.org/assignments/http-methods>.

     +-------------+------+------------+---------------+
     | Method Name | Safe | Idempotent |   Reference   |
     +-------------+------+------------+---------------+
     | CONNECT-IP  |  no  |     no     | This document |
     +-------------+------+------------+---------------+

9.2.  Stream Chunk Type Registration

   This document will request IANA to create a "CONNECT-IP Stream Chunk
   Type" registry.  This registry governs a 62-bit space, and follows
   the registration policy for QUIC registries as defined in [QUIC].  In
   addition to the fields required by the QUIC policy, registrations in
   this registry MUST include the following fields:

   Type:  A short mnemonic for the type.

   Description:  A brief description of the type semantics, which MAY be
      a summary if a specification reference is provided.

   The initial contents of this registry are:

   +-------+---------------------+---------------------+---------------+
   | Value |        Type         |      Description    |   Reference   |
   +-------+---------------------+---------------------+---------------+
   | 0x00  |      IP_PACKET      | Full IP packet      | This document |
   | 0x01  |   ADDRESS_ASSIGN    | Address Assignment  | This document |
   | 0x02  |   ADDRESS_REQUEST   | Address Request     | This document |
   | 0x03  | ROUTE_ADVERTISEMENT | Route Advertisement | This document |
   | 0x04  |   ROUTE_REJECTION   | Route Rejection     | This document |
   | 0x05  |     ROUTE_RESET     | Route Reset         | This document |
   | 0x06  |      SHUTDOWN       | Shutdown Reason     | This document |
   | 0x07  |    ATOMIC_START     | Atomic Start        | This document |
   | 0x08  |     ATOMIC_END      | Atomic End          | This document |
   +-------+---------------------+---------------------+---------------+

   Each value of the format "41 * N + 29" for integer values of N (that
   is, 29, 70, 111, ...) are reserved; these values MUST NOT be assigned
   by IANA and MUST NOT appear in the listing of assigned values.

10.  References



Chernyakhovsky, et al.   Expires 14 October 2021               [Page 11]

Internet-Draft                 CONNECT-IP                     April 2021


10.1.  Normative References

   [H2]       Belshe, M., Peon, R., and M. Thomson, Ed., "Hypertext
              Transfer Protocol Version 2 (HTTP/2)", RFC 7540,
              DOI 10.17487/RFC7540, May 2015,
              <https://www.rfc-editor.org/rfc/rfc7540>.

   [H3DGRAM]  Schinazi, D. and L. Pardue, "Using QUIC Datagrams with
              HTTP/3", Work in Progress, Internet-Draft, draft-ietf-
              masque-h3-datagram-00, 29 January 2021,
              <https://tools.ietf.org/html/draft-ietf-masque-h3-
              datagram-00>.

   [QUIC]     Iyengar, J. and M. Thomson, "QUIC: A UDP-Based Multiplexed
              and Secure Transport", Work in Progress, Internet-Draft,
              draft-ietf-quic-transport-34, 14 January 2021,
              <https://tools.ietf.org/html/draft-ietf-quic-transport-
              34>.

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119,
              DOI 10.17487/RFC2119, March 1997,
              <https://www.rfc-editor.org/rfc/rfc2119>.

   [RFC7230]  Fielding, R., Ed. and J. Reschke, Ed., "Hypertext Transfer
              Protocol (HTTP/1.1): Message Syntax and Routing",
              RFC 7230, DOI 10.17487/RFC7230, June 2014,
              <https://www.rfc-editor.org/rfc/rfc7230>.

   [RFC8174]  Leiba, B., "Ambiguity of Uppercase vs Lowercase in RFC
              2119 Key Words", BCP 14, RFC 8174, DOI 10.17487/RFC8174,
              May 2017, <https://www.rfc-editor.org/rfc/rfc8174>.

   [URI]      Berners-Lee, T., Fielding, R., and L. Masinter, "Uniform
              Resource Identifier (URI): Generic Syntax", STD 66,
              RFC 3986, DOI 10.17487/RFC3986, January 2005,
              <https://www.rfc-editor.org/rfc/rfc3986>.

   [UTF8]     Yergeau, F., "UTF-8, a transformation format of ISO
              10646", STD 63, RFC 3629, DOI 10.17487/RFC3629, November
              2003, <https://www.rfc-editor.org/rfc/rfc3629>.

10.2.  Informative References

   [AUTH]     Fielding, R., Ed. and J. Reschke, Ed., "Hypertext Transfer
              Protocol (HTTP/1.1): Authentication", RFC 7235,
              DOI 10.17487/RFC7235, June 2014,
              <https://www.rfc-editor.org/rfc/rfc7235>.



Chernyakhovsky, et al.   Expires 14 October 2021               [Page 12]

Internet-Draft                 CONNECT-IP                     April 2021


   [REQS]     Chernyakhovsky, A., McCall, D., and D. Schinazi,
              "Requirements for a MASQUE Protocol to Proxy IP Traffic",
              Work in Progress, Internet-Draft, draft-ietf-masque-ip-
              proxy-reqs-01, 8 January 2021,
              <https://tools.ietf.org/html/draft-ietf-masque-ip-proxy-
              reqs-01>.

Appendix A.  Examples

A.1.  Consumer VPN

   In this scenario, the client will typically receive a single IP
   address that the proxy has picked from a pool of addresses it
   maintains.  The client will route all traffic through the tunnel.
   The exchange could look as follows:

       Client                                             Server

       ADDRESS_REQUEST          -------->
         IP Version = 4
         IP Address = 0.0.0.0
         IP Prefix Length = 0

                                <--------  ADDRESS_ASSIGN
                                             IP Version = 4
                                             IP Address = 192.0.2.42
                                             IP Prefix Length = 32

                                <--------  ROUTE_ADVERTISEMENT
                                             IP Version = 4
                                             IP Address = 0.0.0.0
                                             IP Prefix Length = 0

Acknowledgments

   The design of CONNECT-IP was inspired by discussions in the MASQUE
   working group around [REQS].  The authors would like to thank
   participants in those discussions for their feedback.

Authors' Addresses

   Alex Chernyakhovsky
   Google LLC
   1600 Amphitheatre Parkway
   Mountain View, California 94043,
   United States of America

   Email: achernya@google.com



Chernyakhovsky, et al.   Expires 14 October 2021               [Page 13]

Internet-Draft                 CONNECT-IP                     April 2021


   Dallas McCall
   Google LLC
   1600 Amphitheatre Parkway
   Mountain View, California 94043,
   United States of America

   Email: dallasmccall@google.com


   David Schinazi
   Google LLC
   1600 Amphitheatre Parkway
   Mountain View, California 94043,
   United States of America

   Email: dschinazi.ietf@gmail.com



































Chernyakhovsky, et al.   Expires 14 October 2021               [Page 14]
